OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/gpio.c
/**************************************************************************//**
* @file     gpio.c
* @version  V1.00
* $Revision: 5 $
* $Date: 16/02/17 2:44p $
* @brief    NUC970 GPIO driver source file
*
* @note
* Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#include "nuc970.h"
#include "sys.h"
#include "gpio.h"

/** @addtogroup NUC970_Device_Driver NUC970 Device Driver
  @{
*/

/** @addtogroup NUC970_GPIO_Driver GPIO Driver
  @{
*/

/** @addtogroup NUC970_GPIO_EXPORTED_FUNCTIONS GPIO Exported Functions
  @{
*/

static GPIO_CFG gpioCfg;
static INT32 maskTbl[] = {GPIOA_MASK, GPIOB_MASK, GPIOC_MASK, GPIOD_MASK, GPIOE_MASK, GPIOF_MASK, GPIOG_MASK, GPIOH_MASK, GPIOI_MASK, GPIOJ_MASK};


/**
 * @brief       GPIO interrupt handler
 * @return      None
 * @details     This function is used to GPIO interrupt handler.
 */
void GPIO_IRQHandler(void)
{
    UINT32 reg; 
    INT32 i,mask;
    reg = inpw(REG_AIC_ISRH); 
    mask = 0x02000000; /* INT56 */
    reg = inpw(REG_GPIO_ISR);
    for(i=0;i<MAX_PORT;i++)
    if( gpioCfg.IRQCallback[i] != NULL && (reg & (1<<i)) ){
      gpioCfg.IRQCallback[i](inpw(REG_GPIOA_ISR+i*0x40), gpioCfg.IRQUserData[i]);
    }
    outpw(REG_AIC_SCCRH, mask);   /* Clear interrupt */
}

/**
 * @brief       External interrupt 0 handler
 * @return      None
 * @details     This function is used to external interrupt 0 handler.
 */
void GPIO_IRQHandler0(void)
{
    UINT32 reg;    
    INT32 mask;
    reg = inpw(REG_AIC_ISR);
    mask = 0x10;
    if(gpioCfg.EINTIRQCallback[0] != NULL){
      gpioCfg.EINTIRQCallback[0](reg, gpioCfg.EINTIRQUserData[0]);
    }
    outpw(REG_AIC_SCCR, mask);   /* Clear interrupt */
}

/**
 * @brief       External interrupt 1 handler
 * @return      None
 * @details     This function is used to external interrupt 1 handler.
 */
void GPIO_IRQHandler1(void)
{
    UINT32 reg;    
    INT32 mask;
    reg = inpw(REG_AIC_ISR); 
    mask = 0x20;
    if(gpioCfg.EINTIRQCallback[1] != NULL){
      gpioCfg.EINTIRQCallback[1](reg, gpioCfg.EINTIRQUserData[1]);
    }
    outpw(REG_AIC_SCCR, mask);   /* Clear interrupt */
}

/**
 * @brief       External interrupt 2 handler
 * @return      None
 * @details     This function is used to external interrupt 2 handler.
 */
void GPIO_IRQHandler2(void)
{
    UINT32 reg;    
    INT32 mask;
    reg = inpw(REG_AIC_ISR); 
    mask = 0x40;
    if(gpioCfg.EINTIRQCallback[2] != NULL){
      gpioCfg.EINTIRQCallback[2](reg, gpioCfg.EINTIRQUserData[2]);
    }
    outpw(REG_AIC_SCCR, mask);   /* Clear interrupt */
}

/**
 * @brief       External interrupt 3 handler
 * @return      None
 * @details     This function is used to external interrupt 3 handler.
 */
void GPIO_IRQHandler3(void)
{
    UINT32 reg;    
    INT32 mask;
    reg = inpw(REG_AIC_ISR); 
    mask = 0x80;
    if(gpioCfg.EINTIRQCallback[3] != NULL){
      gpioCfg.EINTIRQCallback[3](reg, gpioCfg.EINTIRQUserData[3]);
    }
    outpw(REG_AIC_SCCR, mask);   /* Clear interrupt */
}

/**
 * @brief       External interrupt 4 handler
 * @return      None
 * @details     This function is used to external interrupt 4 handler.
 */
void GPIO_IRQHandler4(void)
{
    UINT32 reg;    
    INT32 mask;
    reg = inpw(REG_AIC_ISR); 
    mask = 0x100;
    if(gpioCfg.EINTIRQCallback[4] != NULL){
      gpioCfg.EINTIRQCallback[4](reg, gpioCfg.EINTIRQUserData[4]);
    }
    outpw(REG_AIC_SCCR, mask);   /* Clear interrupt */
}

/**
 * @brief       External interrupt 5 handler
 * @return      None
 * @details     This function is used to external interrupt 5 handler.
 */
void GPIO_IRQHandler5(void)
{
    UINT32 reg;    
    INT32 mask;
    reg = inpw(REG_AIC_ISR); 
    mask = 0x200;
    if(gpioCfg.EINTIRQCallback[5] != NULL){
      gpioCfg.EINTIRQCallback[5](reg, gpioCfg.EINTIRQUserData[5]);
    }
    outpw(REG_AIC_SCCR, mask);   /* Clear interrupt */
}

/**
 * @brief       External interrupt 6 handler
 * @return      None
 * @details     This function is used to external interrupt 6 handler.
 */
void GPIO_IRQHandler6(void)
{
    UINT32 reg;    
    INT32 mask;
    reg = inpw(REG_AIC_ISR); 
    mask = 0x400;
    if(gpioCfg.EINTIRQCallback[6] != NULL){
      gpioCfg.EINTIRQCallback[6](reg, gpioCfg.EINTIRQUserData[6]);
    }
    outpw(REG_AIC_SCCR, mask);   /* Clear interrupt */
}

/**
 * @brief       External interrupt 7 handler
 * @return      None
 * @details     This function is used to external interrupt 7 handler.
 */
void GPIO_IRQHandler7(void)
{
    UINT32 reg;    
    INT32 mask;
    reg = inpw(REG_AIC_ISR); 
    mask = 0x800;
    if(gpioCfg.EINTIRQCallback[7] != NULL){
      gpioCfg.EINTIRQCallback[7](reg, gpioCfg.EINTIRQUserData[7]);
    }
    outpw(REG_AIC_SCCR, mask);   /* Clear interrupt */
}

/**
 * @brief       Open GPIO Port
 *
 * @param[in]   port       GPIO port. It could be \ref GPIOA, \ref GPIOB, ... or \ref GPIOJ
 * @param[in]   direction  Operation mode. It could be \ref DIR_INPUT or \ref DIR_OUTPUT
 * @param[in]   pull       Operation mode. \ref PULL_UP, \ref NO_PULL_UP
 *
 * @retval      <0              Fail
 * @retval      0               Success
 *
 * @details     This function is used to open gpio port and set gpio port.
 */
INT32 GPIO_Open(GPIO_PORT port, GPIO_DIR direction, GPIO_PULL pull)
{
    UINT32 mask;
    INT32 portIndex;
    INT32 offset;
    
    outpw(REG_CLK_PCLKEN0,inpw(REG_CLK_PCLKEN0) | (1<<3)); //Enable GPIO engin clock.
    offset = (INT32)port;
    portIndex = port / 0x40;
    mask = maskTbl[portIndex];    
    
    if(gpioCfg.bitBusyFlag[portIndex] != 0)
    {
        return GPIO_ERR_PORT_BUSY;
    }
    
    /* Set all bits in the port to busy */
    gpioCfg.bitBusyFlag[portIndex] = mask;
    
    /* Set port direction */
    if(direction == DIR_OUTPUT)
    {
        outpw(REG_GPIOA_DIR + offset , mask);
    }
    else
    {
        outpw(REG_GPIOA_DIR + offset , 0); 
    }

    if(pull == PULL_UP)
    {
        outpw(REG_GPIOA_PUEN + offset , mask);
    }
    else
    {
        outpw(REG_GPIOA_PUEN + offset , 0);
    }

    return SUCCESSFUL;
}

/**
 * @brief       Close GPIO Port
 *
 * @param[in]   port       GPIO port. It could be \ref GPIOA, \ref GPIOB, ... or \ref GPIOJ
 *
 * @retval      <0              Fail
 * @retval      0               Success
 *
 * @details     This function is used to close GPIO port.The GPIO port is restore to default value.
 */
INT32 GPIO_Close(GPIO_PORT port)
{
    INT32 offset;
    INT32 portIndex;

    offset = (INT32)port;    
    portIndex = (port / 0x40);
    
    /* Clean the busy flag */
    gpioCfg.bitBusyFlag[portIndex] = 0;
    
