OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/gpio.c
    /* Reset to input */
    outpw(REG_GPIOA_DIR + offset, 0);

    /* Reset to pull-up */
    outpw(REG_GPIOA_PUEN + offset, 0); 

    return SUCCESSFUL;
}

/**
 * @brief       Set GPIO Port
 *
 * @param[in]   port       GPIO port. It could be \ref GPIOA, \ref GPIOB, ... or \ref GPIOJ
 * @param[in]   bitMap     GPIO port. It could be \ref BIT0 \ref BIT1, ... or \ref BIT31
 *
 * @retval      <0              Fail
 * @retval      0               Success
 *
 * @details     This function is used to set GPIO port output data.
 */
INT32 GPIO_Set(GPIO_PORT port, UINT32 bitMap)
{
    INT32 offset;
    INT32 reg;
    
    offset = (INT32)port;
    
    reg = inpw(REG_GPIOA_DATAOUT + offset);
    reg = reg | bitMap;
    outpw(REG_GPIOA_DATAOUT + offset, reg);

    return SUCCESSFUL;
}

 /**
 * @brief       Clear GPIO port OUT Data
 *
 * @param[in]   port        GPIO port. It could be \ref GPIOA, \ref GPIOB, ... or \ref GPIOJ
 * @param[in]   bitMap      GPIO port data. It could be 0x00 ~ 0xFF.
 *
 * @retval      <0          Fail
 * @retval      0           Success
 *
 * @details     Clear GPIO port output data to 0.
 */
INT32 GPIO_Clr(GPIO_PORT port, UINT32 bitMap)
{
    INT32 offset;
    INT32 reg;
    
    offset = (INT32)port;
    
    reg = inpw(REG_GPIOA_DATAOUT + offset);
    reg = reg & (~bitMap);
    outpw(REG_GPIOA_DATAOUT + offset, reg);

    return SUCCESSFUL;
}

 /**
 * @brief       Read GPIO port in data
 *
 * @param[in]   port        GPIO port. It could be \ref GPIOA, \ref GPIOB, ... or \ref GPIOJ
 *
 * @retval      It could be 0 to 0xFF. If port is  \ref GPIOA ,  \ref BIT0 is PA0 input data, 
 *               \ref BIT1 is PA1 input data, ...  \ref BIT15 is PA15 input data.
 *
 * @details     Read the input data from GPIO port.
 */
UINT32 GPIO_ReadPort(GPIO_PORT port)
{
    UINT32 reg;
    INT32 offset;
    
    offset = (INT32)port;
    
    reg = inpw(REG_GPIOA_DATAIN + offset);

    return reg;
}

 /**
 * @brief       Set GPIO port direction
 *
 * @param[in]   port        GPIO port. It could be \ref GPIOA, \ref GPIOB, ... or \ref GPIOJ
 * @param[in]   direction   GPIO port direction. It could be \ref DIR_INPUT, \ref DIR_OUTPUT.
 * @retval      <0              Fail
 * @retval      0               Success
 *
 * @details     Set the direction into specified GPIO port.
 */
INT32 GPIO_SetPortDir(GPIO_PORT port, GPIO_DIR direction)
{
    INT32 offset;
    INT32 mask;
    INT32 portIndex;
    
    offset = (INT32)port;
    portIndex = (port / 0x40);
    mask = maskTbl[portIndex];
    
    if(direction == DIR_OUTPUT)
    {
        outpw(REG_GPIOA_DIR + offset, mask);
    }
    else
    {
        outpw(REG_GPIOA_DIR + offset, 0x0);
    }

    return SUCCESSFUL;
}

/**
 * @brief       Open GPIO bit
 *
 * @param[in]   port        GPIO port. It could be \ref GPIOA, \ref GPIOB, ... or \ref GPIOJ
 * @param[in]   bit         GPIO pin. It could be \ref BIT0 \ref BIT1, ... or \ref BIT31
 * @param[in]   direction   GPIO direction. It could be \ref DIR_INPUT or \ref DIR_OUTPUT
 * @param[in]   pull        GPIO pull-up. It could be \ref NO_PULL_UP or \ref PULL_UP
 *
 * @retval      <0              Fail
 * @retval      0               Success
 *
 * @details     This function is used to open gpio pin.
 */
INT32 GPIO_OpenBit(GPIO_PORT port, UINT32 bit, GPIO_DIR direction, GPIO_PULL pull)
{
    UINT32 reg;
    UINT32 mask;
    INT32 portIndex;
    INT32 offset;

    outpw(REG_CLK_PCLKEN0,inpw(REG_CLK_PCLKEN0) | (1<<3)); //Enable GPIO engin clock.
    offset = (INT32)port;
    portIndex = (port / 0x040);
    mask = (UINT32)bit;
    
    if((gpioCfg.bitBusyFlag[portIndex]&mask) != 0)
    {
        return GPIO_ERR_BIT_BUSY;
    }

    gpioCfg.bitBusyFlag[portIndex] = gpioCfg.bitBusyFlag[portIndex] | mask;
    
    reg = inpw(REG_GPIOA_DIR + offset);
    reg = reg & (~mask);

    if(direction == DIR_OUTPUT)
    {
        reg = reg | mask;
    }
    
    outpw(REG_GPIOA_DIR + offset, reg);

    reg = inpw(REG_GPIOA_PUEN + offset);
    reg = reg & (~mask);

    if(pull == PULL_UP)
    {
        reg = reg | mask;
    }

    outpw(REG_GPIOA_PUEN + offset, reg);

    return SUCCESSFUL;
}

 /**
 * @brief       Set GPIO pin OUT Data
 *
 * @param[in]   port        GPIO port. It could be \ref GPIOA, \ref GPIOB, ... or \ref GPIOJ
 * @param[in]   bit         GPIO pin. It could be \ref BIT0 \ref BIT1, ... or \ref BIT31
 *
 * @retval      <0              Fail
 * @retval      0               Success
 *
 * @details     Set the Data into specified GPIO pin.
 */
INT32 GPIO_CloseBit(GPIO_PORT port, UINT32 bit)
{
    UINT32 reg;
    UINT32 mask;
    INT32 portIndex;
    INT32 offset;
    
    offset = (INT32)port;
    portIndex = (port / 0x40);
    mask = (UINT32)bit;
    
    gpioCfg.bitBusyFlag[portIndex] = gpioCfg.bitBusyFlag[portIndex] & (~mask);
    
    reg = inpw(REG_GPIOA_DIR + offset);
    reg = reg & (~mask);
    outpw(REG_GPIOA_DIR + offset, reg);

    reg = inpw(REG_GPIOA_PUEN + offset);
    reg = reg & (~mask);
    outpw(REG_GPIOA_PUEN + offset, reg);

    return SUCCESSFUL;
}


/**
 * @brief       Set GPIO pin OUT Data
 *
 * @param[in]   port        GPIO port. It could be \ref GPIOA, \ref GPIOB, ... or \ref GPIOJ
 * @param[in]   bit          GPIO pin. It could be \ref BIT0 \ref BIT1, ... or \ref BIT31
 *
 * @retval      <0              Fail
 * @retval      0               Success
 *
 * @details     Set the Data into specified GPIO pin.
 */
INT32 GPIO_SetBit(GPIO_PORT port, UINT32 bit)
{
    UINT32 bitMap;
    INT32 offset;
    INT32 reg;
    
    offset = (INT32)port;
    bitMap = (UINT32)bit;
    
    reg = inpw(REG_GPIOA_DATAOUT + offset);
    reg = reg | bitMap;
    outpw(REG_GPIOA_DATAOUT + offset, reg);

    return SUCCESSFUL;
}

 /**
 * @brief       Clear GPIO port Interrupt Flag
 *
 * @param[in]   port        GPIO port. It could be \ref GPIOA, \ref GPIOB, ... or \ref GPIOJ
 * @param[in]   bitMap      GPIO port data. It could be 0x00 ~ 0xFF.
 *
 * @retval      <0              Fail
 * @retval      0               Success
 *
 * @details     Clear the interrupt status of specified GPIO port.
 */
INT32 GPIO_ClrISR(GPIO_PORT port, UINT32 bitMap)
{
    INT32 offset;

    offset = (INT32)port;

    outpw(REG_GPIOA_ISR + offset, bitMap);

    return SUCCESSFUL;
}

/**
 * @brief       Clear GPIO Pin Interrupt Flag
 *
 * @param[in]   port        GPIO port. It could be \ref GPIOA, \ref GPIOB, ... or \ref GPIOJ
 * @param[in]   bit         GPIO pin. It could be \ref BIT0 \ref BIT1, ... or \ref BIT31
 *
 * @retval      <0              Fail
 * @retval      0               Success
 *
 * @details     Clear the interrupt status of specified GPIO pin.
 */
INT32 GPIO_ClrISRBit(GPIO_PORT port, UINT32 bit)
{
    UINT32 bitMap;
    INT32 offset;

    offset = (INT32)port;
    bitMap = (UINT32)bit;

    outpw(REG_GPIOA_ISR + offset, bitMap);

    return SUCCESSFUL;
}

 /**
 * @brief       Clear GPIO pin OUT Data
 *
 * @param[in]   port        GPIO port. It could be \ref GPIOA, \ref GPIOB, ... or \ref GPIOJ
 * @param[in]   bit         GPIO pin. It could be \ref BIT0 \ref BIT1, ... or \ref BIT31
 *
 * @retval      <0              Fail
 * @retval      0               Success
 *
 * @details     Set the Data into specified GPIO pin.
 */
INT32 GPIO_ClrBit(GPIO_PORT port, UINT32 bit)
{
    UINT32 bitMap;
    INT32 offset;
    INT32 reg;
    
    offset = (INT32)port;
    bitMap = (UINT32)bit;
    
    reg = inpw(REG_GPIOA_DATAOUT + offset);
    reg = reg & (~bitMap);
    outpw(REG_GPIOA_DATAOUT + offset, reg);

    return SUCCESSFUL;
}

 /**
 * @brief       Read GPIO pin In Data
 *
 * @param[in]   port        GPIO port. It could be \ref GPIOA, \ref GPIOB, ... or \ref GPIOJ
 * @param[in]   bit         GPIO pin. It could be \ref BIT0 \ref BIT1, ... or \ref BIT31
 *
 * @retval      1/0         GPIO pin input data.
 *
 * @details     Read the In Data from GPIO pin.
 */
INT32 GPIO_ReadBit(GPIO_PORT port, UINT32 bit)
{
    UINT32 reg;
    UINT32 bitMap;
    INT32 offset;

    offset = (INT32)port;
    bitMap = (UINT32)bit;
    
    reg = inpw(REG_GPIOA_DATAIN + offset);
    
    return ((reg & bitMap)?1:0);
}

 /**
 * @brief       Set GPIO pin direction
 *
 * @param[in]   port        GPIO port. It could be \ref GPIOA, \ref GPIOB, ... or \ref GPIOJ
 * @param[in]   bit         GPIO pin. It could be \ref BIT0 \ref BIT1, ... or \ref BIT31
 * @param[in]   direction   GPIO direction. It could be \ref DIR_INPUT, \ref DIR_OUTPUT.
 *
 * @retval      <0              Fail
 * @retval      0               Success
 *
 * @details     Set the GPIO direction into specified GPIO pin.
 */
INT32 GPIO_SetBitDir(GPIO_PORT port, UINT32 bit, GPIO_DIR direction)
{
    UINT32 reg;
    UINT32 bitMap;
    INT32 offset;
    
    offset = (INT32)port;
    bitMap = (UINT32)bit;
    
    reg = inpw(REG_GPIOA_DIR + offset);
    reg = reg & (~bitMap);
    
    if(direction == DIR_OUTPUT)
    {
        reg = reg | bitMap;
    }

    outpw(REG_GPIOA_DIR + offset, reg);

    return SUCCESSFUL;
}

 /**
 * @brief       Check GPIO pin is used
 *
 * @param[in]   port        GPIO port. It could be \ref GPIOA, \ref GPIOB, ... or \ref GPIOJ
 * @param[in]   bit         GPIO pin. It could be \ref BIT0 \ref BIT1, ... or \ref BIT31
 * @retval      None
 *
 * @details     It is function is used to check GPIO pin is used.
 */
BOOL GPIO_BitIsUsed(GPIO_PORT port, UINT32 bit)
{
    UINT32 mask;
    INT32 portIndex;

    portIndex = (port / 0x40);
    mask = (UINT32)bit;
    
    return ((gpioCfg.bitBusyFlag[portIndex] & mask)?TRUE:FALSE);
}

/**
 * @brief       Enable GPIO port interrupt
 *
 * @param[in]   port            GPIO port. It could be \ref GPIOA, \ref GPIOB, ... or \ref GPIOJ
 * @param[in]   callback        The callback function.It could be " INT32 GpioCallback(UINT32 status, UINT32 userData); "
 * @param[in]   userData        This paramater is used by callback functions.
 *
 * @retval      <0              Fail
 * @retval      0               Success
 *
 * @details     This function is used to enable specified GPIO port interrupt.
 */
INT32 GPIO_EnableInt(GPIO_PORT port, GPIO_CALLBACK callback, UINT32 userData)
{
    INT32 portIndex;
    portIndex = (INT32)port/0x40;
    if(callback != NULL)
    {
        gpioCfg.IRQCallback[portIndex] = (GPIO_CALLBACK)callback;
        gpioCfg.IRQUserData[portIndex] = userData;
    }
    sysInstallISR(IRQ_LEVEL_7, GPIO_IRQn, (PVOID)GPIO_IRQHandler);
    sysEnableInterrupt(GPIO_IRQn);
    sysSetLocalInterrupt(ENABLE_IRQ);
    return SUCCESSFUL;
}

/**
 * @brief       Disable GPIO port interrupt
 *
 * @param[in]   port        GPIO port. It could be \ref GPIOA, \ref GPIOB, ... or \ref GPIOJ
 *
 * @retval      <0              Fail
 * @retval      0               Success
 *
 * @details     This function is used to disable specified GPIO port interrupt.
 */
INT32 GPIO_DisableInt(GPIO_PORT port)
{
    INT32 i,portIndex;
    portIndex = (INT32)port/0x40;

    gpioCfg.IRQCallback[portIndex] = NULL;
    gpioCfg.IRQUserData[portIndex] = 0;

    for(i=0;i<MAX_PORT;i++)
      if(gpioCfg.IRQCallback[i]!=0) 
        return SUCCESSFUL;
    sysDisableInterrupt(GPIO_IRQn);
    return SUCCESSFUL;
}

/**
 * @brief       Enable external I/O interrupt
 *
 * @param[in]   nIrq            External interrupt. It could be \ref NIRQ0, \ref NIRQ1, ... or \ref NIRQ7
 * @param[in]   callback        The callback function.It could be " INT32 GpioCallback(UINT32 status, UINT32 userData); "
 * @param[in]   userData        This paramater is used by callback functions.
 *
 * @retval      <0              Fail
 * @retval      0               Success
 *
 * @details     This function is used to enable specified external I/O interrupt.
 */
INT32 GPIO_EnableEINT(GPIO_NIRQ nIrq, GPIO_CALLBACK callback, UINT32 userData)
{
    if(callback != NULL)
    {
        gpioCfg.EINTIRQCallback[nIrq] = (GPIO_CALLBACK)callback;
        gpioCfg.EINTIRQUserData[nIrq] = userData;
    }
    sysSetLocalInterrupt(ENABLE_IRQ);
    switch(nIrq)
    {
    case 0:
      sysInstallISR(IRQ_LEVEL_7, EINT0_IRQn, (PVOID)GPIO_IRQHandler0);
      sysEnableInterrupt(EINT0_IRQn);
    break;

    case 1:
      sysInstallISR(IRQ_LEVEL_7, EINT1_IRQn, (PVOID)GPIO_IRQHandler1);
      sysEnableInterrupt(EINT1_IRQn);
    break;

