OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/gpio.c
    case 2:
      sysInstallISR(IRQ_LEVEL_7, EINT2_IRQn, (PVOID)GPIO_IRQHandler2);
      sysEnableInterrupt(EINT2_IRQn);
    break;

    case 3:
      sysInstallISR(IRQ_LEVEL_7, EINT3_IRQn, (PVOID)GPIO_IRQHandler3);
      sysEnableInterrupt(EINT3_IRQn);
    break;

    case 4:
      sysInstallISR(IRQ_LEVEL_7, EINT4_IRQn, (PVOID)GPIO_IRQHandler4);
      sysEnableInterrupt(EINT4_IRQn);
    break;

    case 5:
      sysInstallISR(IRQ_LEVEL_7, EINT5_IRQn, (PVOID)GPIO_IRQHandler5);
      sysEnableInterrupt(EINT5_IRQn);
    break;

    case 6:
      sysInstallISR(IRQ_LEVEL_7, EINT6_IRQn, (PVOID)GPIO_IRQHandler6);
      sysEnableInterrupt(EINT6_IRQn);
    break;

    case 7:
      sysInstallISR(IRQ_LEVEL_7, EINT7_IRQn, (PVOID)GPIO_IRQHandler7);
      sysEnableInterrupt(EINT7_IRQn);
    break;
   };
    sysSetLocalInterrupt(ENABLE_IRQ);
    return SUCCESSFUL;
}

/**
 * @brief       Enable GPIO trigger type.
 *
 * @param[in]   port        GPIO port. It could be \ref GPIOA, \ref GPIOB, ... or \ref GPIOJ
 * @param[in]   bitMap      GPIO port. It could be \ref BIT0 \ref BIT1, ... or \ref BIT31
 * @param[in]   triggerType The triggerType of specified GPIO pin. It could be \n
 *                          \ref RISING, \ref FALLING, \ref BOTH_EDGE, \ref HIGH, \ref LOW.
 *
 * @retval      <0          Fail
 * @retval      0           Success
 *
 * @details     This function is used to enable trigger type.
 */
INT32 GPIO_EnableTriggerType(GPIO_PORT port, UINT32 bitMap, GPIO_TRIGGER_TYPE triggerType)
{
    UINT32 reg;
    INT32 offset;
    
    offset = (INT32)port;

    switch(triggerType)
    {
       case LOW:
         reg = inpw(REG_GPIOA_IMD+offset);
         outpw(REG_GPIOA_IMD+offset,reg | bitMap);

         reg = inpw(REG_GPIOA_IREN+offset);
         outpw(REG_GPIOA_IREN+offset,reg & ~bitMap);

         reg = inpw(REG_GPIOA_IFEN+offset);
         outpw(REG_GPIOA_IFEN+offset,reg  | bitMap);
       break;
       case HIGH:
         reg = inpw(REG_GPIOA_IMD+offset);
         outpw(REG_GPIOA_IMD+offset,reg | bitMap);

         reg = inpw(REG_GPIOA_IREN+offset);
         outpw(REG_GPIOA_IREN+offset,reg | bitMap);

         reg = inpw(REG_GPIOA_IFEN+offset);
         outpw(REG_GPIOA_IFEN+offset,reg & ~bitMap);
       break;
       case FALLING:
         reg = inpw(REG_GPIOA_IMD+offset);
         outpw(REG_GPIOA_IMD+offset,reg & ~bitMap);

         reg = inpw(REG_GPIOA_IREN+offset);
         outpw(REG_GPIOA_IREN+offset,reg & ~bitMap);

         reg = inpw(REG_GPIOA_IFEN+offset);
         outpw(REG_GPIOA_IFEN+offset,reg  | bitMap);
       break;
       case RISING:
         reg = inpw(REG_GPIOA_IMD+offset);
         outpw(REG_GPIOA_IMD+offset,reg & ~bitMap);

         reg = inpw(REG_GPIOA_IREN+offset);
         outpw(REG_GPIOA_IREN+offset,reg | bitMap);

         reg = inpw(REG_GPIOA_IFEN+offset);
         outpw(REG_GPIOA_IFEN+offset,reg & ~bitMap);
       break;
       case BOTH_EDGE:
         reg = inpw(REG_GPIOA_IMD+offset);
         outpw(REG_GPIOA_IMD+offset,reg & ~bitMap);

         reg = inpw(REG_GPIOA_IREN+offset);
         outpw(REG_GPIOA_IREN+offset,reg | bitMap);

         reg = inpw(REG_GPIOA_IFEN+offset);
         outpw(REG_GPIOA_IFEN+offset,reg | bitMap);
       break;
    }
    return SUCCESSFUL;
}

/**
 * @brief       Disable GPIO trigger type.
 *
 * @param[in]   port        GPIO port. It could be \ref GPIOA, \ref GPIOB, ... or \ref GPIOJ
 * @param[in]   bitMap      GPIO port. It could be \ref BIT0 \ref BIT1, ... or \ref BIT31
 *
 * @retval      <0          Fail
 * @retval      0           Success
 *
 * @details     This function is used to disable trigger type.
 */
INT32 GPIO_DisableTriggerType(GPIO_PORT port, UINT32 bitMap)
{
    UINT32 reg;
    INT32 offset;
    
    offset = (INT32)port;

    reg = inpw(REG_GPIOA_IMD+offset);
    outpw(REG_GPIOA_IMD +offset,reg & ~bitMap);

    reg = inpw(REG_GPIOA_IREN+offset);
    outpw(REG_GPIOA_IREN+offset,reg & ~bitMap);

    reg = inpw(REG_GPIOA_IFEN+offset);
    outpw(REG_GPIOA_IFEN+offset,reg & ~bitMap);

    return SUCCESSFUL;
}

/**
 * @brief       Disable external I/O interrupt
 *
 * @param[in]   nIrq            External I/O interrupt. It could be \ref NIRQ1, \ref NIRQ2, ... or \ref NIRQ7
 *
 * @retval      <0              Fail
 * @retval      0               Success
 *
 * @details     This function is used to disable external I/O interrupt.
 */
INT32 GPIO_DisableEINT(GPIO_NIRQ nIrq)
{
    sysDisableInterrupt((IRQn_Type)(nIrq+4));
    gpioCfg.IRQCallback[nIrq] = NULL;
    gpioCfg.IRQUserData[nIrq] = 0;
    return SUCCESSFUL;
}

/**
 * @brief       Enable GPIO De-bounce Function
 *
 * @param[in]   debounceClkSel        The de-bounce sampling cycle selection. It could be 0~0xF.  \n
 *                                     0 = Sample interrupt input once per 1 clocks. \n
 *                                     1 = Sample interrupt input once per 2 clocks. \n
 *                                     2 = Sample interrupt input once per 4 clocks. \n
 *                                     3 = Sample interrupt input once per 8 clocks. \n
 *                                     4 = Sample interrupt input once per 16 clocks. \n
 *                                     5 = Sample interrupt input once per 32 clocks. \n
 *                                     6 = Sample interrupt input once per 64 clocks. \n
 *                                     7 = Sample interrupt input once per 128 clocks. \n
 *                                     8 = Sample interrupt input once per 256 clocks. \n
 *                                     9 = Sample interrupt input once per 2*256 clocks. \n
 *                                    10 = Sample interrupt input once per 4*256 clocks. \n
 *                                    11 = Sample interrupt input once per 8*256 clocks. \n
 *                                    12 = Sample interrupt input once per 16*256 clocks. \n
 *                                    13 = Sample interrupt input once per 32*256 clocks. \n
 *                                    14 = Sample interrupt input once per 64*256 clocks. \n
 *                                    15 = Sample interrupt input once per 128*256 clocks
 *
 * @retval      <0              Fail
 * @retval      0               Success
 *
 * @details     Enable the interrupt de-bounce function of specified GPIO.
 */
INT32 GPIO_EnableDebounce(INT32 debounceClkSel)
{
    UINT32 reg;

    reg = inpw(REG_GPIO_DBNCECON);

    /* Setting the debounce timing */
    reg = ((reg & ~0xf) | debounceClkSel);

    /* Enable the debounce function */
    reg = reg | 0x20;
    outpw(REG_GPIO_DBNCECON, reg);
    
    return SUCCESSFUL;
}

/**
 * @brief       Disable GPIO De-bounce Function.
 *
 * @retval      <0              Fail
 * @retval      0               Success
 *
 * @details     Disable the interrupt de-bounce function of specified GPIO.
 */
INT32 GPIO_DisableDebounce(void)
{
    UINT32 reg;

    reg = inpw(REG_GPIO_DBNCECON);

    /* Setting the debounce timing */
    reg = ((reg & ~0xf));

    /* Enable the debounce function */
    reg = reg | 0x20;
    outpw(REG_GPIO_DBNCECON, reg);
    
    return SUCCESSFUL;
}

/*@}*/ /* end of group NUC970_GPIO_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group NUC970_GPIO_Driver */

/*@}*/ /* end of group NUC970_Device_Driver */

/*** (C) COPYRIGHT 2013 Nuvoton Technology Corp. ***/
